tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"

# Shell & prompt
brew "fish"
brew "fisher"
brew "starship"

# Core CLI
brew "bat"
brew "bottom"
brew "cbonsai"
brew "direnv"
brew "dust"
brew "fd"
brew "fzf"
brew "gnupg"
brew "htop"
brew "jq"
brew "lsd"
brew "macchina"
brew "pinentry-mac"
brew "ripgrep"
brew "rsync"
brew "tlrc"
brew "topgrade"
brew "yazi"
brew "zoxide"

# Git
brew "gh"
brew "git-delta"
brew "git-extras"
brew "git-filter-repo"
brew "git-lfs"
brew "yadm"

# Editors & multiplexer
brew "neovim"
brew "tmux"

# Build & toolchains
brew "cmake"
brew "ninja"
brew "rustup"
brew "uv"
brew "oven-sh/bun/bun"

# Containers
brew "colima"

# macOS UI
brew "felixkratz/formulae/borders"

# Apps
cask "aerospace"
cask "alfred"
cask "arc"
cask "chatgpt"
cask "claude"
cask "claude-code@latest"
cask "codex"
cask "codex-app"
cask "ghostty"
cask "obsidian"
cask "signal"
cask "spark-app"
cask "stats"
cask "tailscale-app"
cask "telegram"
cask "zed@preview"

# Fonts (JetBrains Mono: zed; Symbols: zed nerd-icon fallback)
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
